[
    {
        "id": 1,
        "title": "Going to an e-sport event is like traveling back to the time when people followed sports for the sport",
        "posted" : "2018-05-31T06:33:30.174Z",
        "summary": "Think about your favorite spectator sport. Do you remember a time when you were just into the game itself, without the complicating and exciting factor of having a team to root for? For most people, the experience of watching competitive sports is inherently connected to cheering for a particular team or player. In my case, that sport was basketball, and I literally can’t recall having any interest in it before the Michael Jordan Bulls captured my passion and attention. But when it comes to e-sports, a field very much in development, franchise loyalty remains secondary to the love of the game.",
        "content": {
            "tags": [ "eSports", "tournaments", "Dota 2" ],
            "paragraphs": [
                "This past weekend, I attended the first big Dota 2 tournament held in the UK, the $1 million Birmingham Major hosted by ESL One, and I got to experience two uniquely pleasurable things. It was the first time I watched professionals play my favorite video game, and it was the first time I observed a sport, albeit an e-sport, being followed and supported purely for its own sake and not because of teams and players. More than 8,000 people gathered in Birmingham for a common cause: not to trade barbs and witless repartee, but to celebrate the game that they (we) all love.",
                "My thoughts from the event are numerous and varied, so I decided to organize them into a set of similarities to and differences from the more familiar athletic sports gatherings.",
                "Players were introduced with much the same theatrical fanfare that you’d expect from something like a pro wrestling event: each team emerging from a puff of smoke punctuated by searching bright lights, and players walking through a human forest of enthusiastic high fives. This has become a fairly common aspect of live e-sports, not exclusive to Dota 2 or this particular event. The teams involved in e-sports are working hard to sow the seeds for a loyalty that transcends the individual game, and this sheen of hype is instrumental to that effort.",
                "Despite the hype and energy that comes with experiencing a competitive event firsthand, I do find that both athletic contests and e-sports are better experienced at home. Granted, I haven’t had courtside seats at Wimbledon yet, but the vast majority of sports and games are presented much better in video format nowadays. It’s to the credit of the camera operators and sound engineers who make us feel like we’re right in the heart of live action while we’re sitting on our couches. And it’s doubly true for natively digital products like a Dota 2 game. As fans, we go to the arenas and stadiums primarily for the socialized excitement we can only feel in those places, the ability to get lost in the collective emotion for a few hours.",
                "One compelling thing about traditional sports that e-sports haven’t been able to reproduce is the immediate connection between a player’s play and their emotional state. Thinking back to the ‘90s, I don’t remember score lines or win-loss records. I remember Jordan’s furrowed brows when losing, extended tongue when dunking, and perpetual gum-chewing in between. I remember John Stockton’s stoicism, Dennis Rodman’s tempestuousness, and Dikembe Mutombo’s big grin behind a wagging finger. In Dota, players can only really express their personality through their play.",
                "Through the course of the three-day Birmingham Major weekend, I sat at every possible position in the arena, from the front row to the high seats on either side to all the way at the back. No matter where I was, I felt no direct connection to the players. Half the time, all I could see of the stage were the backs of the monitors the game was being played on. The Overwatch League tries to get around this issue by having a persistent display of the players, but even with that setup, looking at the players means not looking at the game, so they serve as more of a distraction than an integrated part of the spectator experience. And regardless, being a professional e-sports player requires the discipline to remain laser-focused on your screen until the end, which makes your physical self a profoundly unexciting sight."
            ],
            "image": "https://cdn.vox-cdn.com/thumbor/vmcS-xJIBey_LyjujPCHFmq76l4=/0x0:2040x1360/920x0/filters:focal(0x0:2040x1360)/cdn.vox-cdn.com/uploads/chorus_asset/file/11440021/dota2birminghammajor_vladsavov2018_00004.jpg"
        },
        "thumbnail": "https://cdn.vox-cdn.com/thumbor/HEhc2A7vBzC5iQulGnVUdAgUmWk=/0x0:2040x1360/920x0/filters:focal(0x0:2040x1360)/cdn.vox-cdn.com/uploads/chorus_asset/file/11440017/dota2birminghammajor_vladsavov2018_00002.jpg"
    },
    {
        "id": 2,
        "title": "OpTic and Virtus Pro successfully navigate the semifinals at ESL One Birmingham",
        "posted" : "2018-05-30T04:33:30.174Z",
        "summary": "Yesterday, paiN Gaming couldn't overcome Virtus Pro, the final boss of the Pro Circuit season. The Russian squad disposed of the Brazilians in just two games, without even breaking a sweat. Championship Sunday is underway at ESL One Birmingham, starting with Jacky 'EternaLEnVy' Mao and the rest of Fnatic battling paiN Gaming in the third-place match for a total of 300 Dota 2 Pro Circuit points.",
        "content": {
            "tags": [ "OpTic", "Virtus Pro", "roster", "change" ],
            "paragraphs": [
                "All five players on VP were firing on all cylinders, showing both paiN Gaming and the Dota 2 community just how dangerous they really are. All things considered, they're the one team most favored to win The International 8 in Vancouver later this year—especially after the rather mediocre results posted by TI7 winners Team Liquid as of late.",
                "It was a rather unfortunate end to paiN Gaming's hot streak in this particular event, where they defeated major threats such as DAC 2018 champions Mineski, as well as Team Liquid.",
                "Fnatic's best-of-three series against OpTic went the full distance, though the first two games ended before they even hit the 30-minute mark. OpTic's use of Visage in the first game proved instrumental in securing the laning phase, allowing Per Olsson 'Pajkatt' Lille to farm away on Gyrocopter. Both supports Ludwig 'zai' Wahlberg and Peter 'ppd' Dager also contributed heavily to the gameplan.",
                "Fnatic struck back with immense speed and aggression in the second game, holding OpTic to just a single kill. In fact, that one kill was first blood for the Americans—which then set off Fnatic, who went on to score 25 consecutive kills against OpTic. The Green Wall stood no chance in game two.",
                "But of course, no captain is better at making adjustments in a long series than ppd. Drafting Lycan for Neta '33' Shapira in the third game, OpTic shut the door on Fnatic and the series with a push-focused strategy. The plan worked wonders against EternaLEnVy's Spectre, which OpTic held to a 21-minute Radiance—that's hardly an ideal timing for such a farm-dependent hero.",
                "OpTic now have a chance to sneak into TI8 direct invite contention—but first they'll have to beat the ferocious Russian bears of Virtus Pro. A second-place finish won't suffice, however, because such a result will place them just below the cutoff point.",
                "Find out what happens in the epic conclusion to ESL One Birmingham when the grand finals begin at 9am CT."
            ],
            "image": "https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/thumbor/OxWx7eZjF3jesEbwrJSwjEbYiaU=/1200x0/filters:no_upscale()/https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/article/3d093822-7724-40c6-95dd-30121a6b3194.jpg"
        },
        "thumbnail": "https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/thumbor/OxWx7eZjF3jesEbwrJSwjEbYiaU=/1200x0/filters:no_upscale()/https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/article/3d093822-7724-40c6-95dd-30121a6b3194.jpg"
    },
    {
        "id": 3,
        "title": "Fly and S4 leave OG... to join Evil Geniuses",
        "posted" : "2018-05-30T03:03:30.174Z",
        "summary": "OG loses Fly, its captain and one of its founding members. Is EG unstoppable now?",
        "content": {
            "tags": [ "OG", "EG", "roster", "change" ],
            "paragraphs": [
                "Yesterday news broke that Evil Geniuses had kicked Misery and lost Fear, leaving the NA team with just three players ahead of their scheduled appearance at the China Super Major. However, there was little time to speculate who they would bring in, as their two new players have already been announced. While most predictions assumed Evil Geniuses would bring in North American players, they have in fact recruited OG's Gustav 's4' Magnusson and captain Tal 'Fly' Aizik.",
                "Fly was of course one of the only two founding members left of the original OG, after starting the team and organisation with Johan 'BigDaddyN0tail' Sundstein back in 2015. Fly's move to Evil Geniuses sees him reunite with Cr1t, a player who was also part of the Major winning OG roster, but who was later replaced by JeraX after moving to Evil Geniuses. ",
                "The second player to make the move to Evil Geniuses is S4, and although the Swede has never played for the NA organisation, he has played with Artour 'Arteezy' Babaev during their time in Team Secret together. S4 joined OG in September 2016 along with Jesse 'JerAx' Vainikka, and will continue to play offlane in his new team, with Sumail 'SumaiL' Syed Hassan returning to the mid lane.",
                "The official announcement made by Evil Geniuses included a statement made by COO Phillip Aram, in which he added a bit of background behind the departure of Fear and Misery from the roster.",
                "OG have announced they will withdraw from the Super Major but Evil Geniuses made no such statement in their announcement, making it highly probable we will see the new roster in action later this week at the final DPC event of the 2017-2018 season."
            ],
            "image": "https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/thumbor/Y4DzWmqHbLFaIoXA8yroroT_55A=/1200x0/filters:no_upscale()/https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/article/21a6669d-6144-4a08-b373-71e68a926b2e.jpg"
        },
        "thumbnail": "https://cdn0.gamesports.net/content_teasers/69000/69949.jpg?1527531195"
    },
    {
        "id": 4,
        "title": "Evil Geniuses release Fear from its Dota 2 roster",
        "posted" : "2018-05-29T16:15:18.174Z",
        "summary": "After releasing captain Rasmus 'MiSeRy' Filipsen from the Dota 2 roster earlier today, it seems as if Evil Geniuses has made another big change to its lineup.",
        "content": {
            "tags": [ "OG", "EG", "Fear", "roster" ],
            "paragraphs": [
                "Longtime EG player Clinton 'Fear' Loomis revealed via Twitter that he has departed from the team as well, leaving the roster to include just Artour 'Arteezy' Babaev, Sumail 'Suma1L' Hassan, and Andreas 'Cr1t-' Nielsen.",        
                "The roster move comes just days after EG's shocking loss to Team Spirit at ESL One Birmingham, which sealed their worst placing since The International 2017. Since Fear was not on EG's TI7 roster, the Birmingham placing was his worst in nearly two years, when he placed top 16 at The Manila Major in June 2016.",
                "Fear had been a mainstay in Evil Geniuses for the past seven years, first joining the organization in October 2011. In that time, Fear was a part of nearly a dozen championships, including his greatest career achievement: winning The International 2015.",
                "Although there were several periods in that seven-year window where the Oregon native did not play on the active roster, Fear always seemed to be helping Evil Geniuses in some way. Whether it was playing in a position the team needed or using his mind to coach the lineup, Fear was ready and able to aid the team in the pursuit of success.",
                "But it looks like that era has ended, and both sides seem eager to move on to the next chapter. Fear and EG have had their fair share of issues in the past nine months since he returned to the active roster. In the numerous events they attended, EG only captured one title. Although some squads would take consistent top eight placings and the occasional championship, EG aren't that team.",
                "Instead they have decided to shuffle their roster just months before the biggest event of the year, and depending on the crowdfunding results, the most lucrative esports event in history.",
                "EG fans and critics alike are certainly anxious to see what players the popular team will acquire ahead of The International 2018."
            ],
            "image": "https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/thumbor/arkih_HfVyJORCa-p504gLgYhi0=/1200x0/filters:no_upscale()/https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/article/18fba8a7-1653-4bf0-9faf-2e1a0520deb7.jpg"
        },
        "thumbnail": "https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/thumbor/arkih_HfVyJORCa-p504gLgYhi0=/1200x0/filters:no_upscale()/https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/article/18fba8a7-1653-4bf0-9faf-2e1a0520deb7.jpg"
    },
    {
        "id": 5,
        "title": "CompLexity releases Chessie, adds Adam and Moonmeander to its Dota 2 roster",
        "posted" : "2018-05-29T06:10:50.174Z",
        "summary": "In a day where Evil Geniuses made two major changes to its Dota 2 roster, compLexity Gaming revealed some lineup moves as well.",
        "content": {
            "tags": [ "Complexity", "Adam", "Moonmeander", "roster", "change" ],
            "paragraphs": [
                "David 'Moonmeander' Tan and Adam Shah have joined coL's roster, while Rasmus 'Chessie' Blomdin has been released. With the departure of Chessie, the compLexity lineup includes Moonmeander, who will take over offlane, the new five-position Adam, Zakari 'Zfreek' Freedman, Linus 'Limmp' Blomdin, and David 'Moo' Hull, who will return to the carry position.",
                "After removing Kyle Freedman from its roster due to 'personality conflicts' in March, compLexity used stand-ins Martin 'Saksa' Sazdov and Kartik 'kitrak' Rathi while searching for a permanent replacement.",
                "In that time, they were rather unsuccessful, evident by their failure to qualify for four separate tournaments. The team also lost four of their five matches in their lone offline event, placing top 10 at the 12-team EPICENTER XL event earlier in the month.",
                "The struggles were a sign that something needed to change, and it seems coL decided that Chessie was more a part of the problem than the solution. That decision means Chessie will be looking for a different team to call home for the first time in nearly three years.",
                "In his place are the assumed-to-be solutions, Adam and Moonmeander—two players who have a lot of experience. In addition to his playing experience, Adam's coaching stop at Fnatic may certainly bring a new perspective to compLexity.",
                "These signings also mark a homecoming for both Adam and Moonmeander. Although Adam never played on the active roster—he served as coL's coach from June 2016 to August 2017—Moonmeander played in his first The International as a part of compLexity in 2015.",
                "When Moonmeander first competed with compLexity, neither Moon or the team played very well. He will look to change that this time around and Adam will aim to make a splash as he returns to playing after nearly half of a year of coaching."
            ],
            "image": "https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/thumbor/h0FvryXLoVkd_MH2yL28uustsHE=/1200x0/filters:no_upscale()/https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/article/42c9dd41-d43e-45b6-acb5-812b7d710008.jpg"
        },
        "thumbnail": "https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/thumbor/h0FvryXLoVkd_MH2yL28uustsHE=/1200x0/filters:no_upscale()/https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/article/42c9dd41-d43e-45b6-acb5-812b7d710008.jpg"
    },
    {
        "id": 6,
        "title": "MiSeRy tweets that he was kicked from Evil Geniuses' Dota 2 team",
        "posted" : "2018-05-28T10:15:41.174Z",
        "summary": "Rasmus 'MiSeRy' Filipsen has been released from the Evil Geniuses Dota 2 team, according to the Danish support on Twitter.",
        "content": {
            "tags": [ "OG", "EG", "MiSeRy", "The International" ],
            "paragraphs": [
                "After crashing out of the ESL One Birmingham major without a win, EG decided to make a change to its roster. That change came at the expense of the captain MiSeRy, who joined the team in December 2017. In a tweet at 2:48pm CT, MiSeRy informed fans of his departure from the roster.",
                "'I have been kicked from EG, Im happy and relieved to be out,' MiSeRy said. 'Thanks for all your support while in the team! What is next?'",
                "MiSeRy and EG saw some success during his five-month stay on the team. Their first tournament together was the Captains Draft 4.0, where EG won two matches in group play before falling to Team Secret in the playoffs. Subsequent tournaments went better as EG picked up a second-place finish at Galaxy Battles II and placed top three at ESL One Genting, their first Major event as a team.",
                "EG failed to place as well as they did in Genting at any of the following majors, although they continued to stick around the top six. That changed, however, at this week's ESL One Birmingham.",
                "EG lost their opening group stage match to Fnatic in one of the most exciting Dota 2 games in recent memory. The loss set them up for an elimination match against CIS squad Team Spirit, who were beaten by Virtus Pro in less than 30 minutes. Most fans expected EG to win and move on to the decider match, but Spirit eliminated MiSeRy and crew from the tournament.",
                "The loss to Spirit sealed EG's top 12 placing, their lowest finish since last year's The International. It was also MiSeRy's lowest placing since April 2017, when he earned a top 16 finish as a part of Thunderbirds at The Kiev Major.",
                "With The International 2018 coming up in two and a half months, and qualifiers beginning in mere weeks, many Dota 2 fans will be anxious to see where MiSeRy lands, and who will replace him on one of the most popular teams in the world."
            ],
            "image": "https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/thumbor/bbHxml6MYRDg2b6v_uEPSIni8SY=/1200x0/filters:no_upscale()/https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/article/b3661f67-8bb2-4548-89ba-25bcbda42b54.png"
        },
        "thumbnail": "https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/thumbor/bbHxml6MYRDg2b6v_uEPSIni8SY=/1200x0/filters:no_upscale()/https://dotesports-cdn-prod-tqgiyve.stackpathdns.com/article/b3661f67-8bb2-4548-89ba-25bcbda42b54.png"
    }
]